[
    {
      "id": 1,
      "title": "SDAS Developer",
      "experience": "5+ years",
      "location": "Chennai / Bengaluru / Gurugram",
      "jobtype": "Full Time",
      "description": "<h2 classname=title>Introduction</h2><p>We are seeking an experienced SDAS Developer with a strong background in AWS, backend development, and UI technologies. The ideal candidate will have deep expertise in AWS services, proficient backend development skills, and a solid understanding of modern UI frameworks to build scalable, secure, and efficient applications.<h2 classname=title>Key Responsibilities</h2><ul><li>Design, develop, and deploy applications within the SDAS framework.<li>Implement and manage AWS infrastructure with best practices.<li>Develop and maintain backend systems using Python, SQL, Spark, and Apache Iceberg.<li>Build responsive and dynamic UI applications with React and AWS Amplify.<li>Ensure code quality through best practices, code reviews, and automated testing.<li>Collaborate with cross-functional teams to deliver robust and scalable solutions.</ul><h2 classname=title>Required Skills and Qualifications</h2><p><strong>AWS Subject Matter Expertise:</strong><ul><li>AWS WAF (Web Application Firewall)<li>CloudFront or Terraform for infrastructure as code<li>AWS Cognito for authentication and authorization<li>AWS Lambda, API Gateway, and Step Functions<li>Amazon Athena and S3 for data querying and storage<li>AWS Glue Data Catalog for metadata management<li>DynamoDB for NoSQL database solutions</ul><h2 classname=title>Backend Development</h2><ul><li>Proficiency in Python, including packaging and deploying applications with best practices (code quality, linting, etc.)<li>Strong SQL skills for database querying and management<li>Experience with Apache Spark for big data processing<li>Familiarity with Apache Iceberg for managing large analytic table.</ul><h2 classname=title>UI Development</h2><ul><li>Strong knowledge of JavaScript with React library<li>Experience in packaging React applications and deploying to AWS environments<li>Proficiency in AWS Amplify for developing and deploying full-stack applications</ul><h2 classname=title>Preferred Qualifications</h2><ul><li>Experience with CI/CD pipelines and DevOps practices<li>Strong problem-solving skills and the ability to work independently<li>Excellent communication and teamwork abilities</ul><h2 classname=title>Education</h2><ul><li>Bachelor’s degree in Computer Science, Information Technology, or related field (or equivalent work experience)</ul><p><strong>How to Apply:</strong> Interested candidates are invited to submit their resume along with a cover letter detailing their relevant experience to careers@maxcurve.co.in.<p><strong>Maxcurve Technologies</strong> is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.",
      "slug": "sdas-developer"
    },
    {
        "id": 2,
        "title": "QA Analyst",
        "experience": "5+ years",
        "location": "Chennai / Bengaluru / Gurugram",
        "jobtype": "Full Time",
        "description": "<h2 classname=title>Job Description</h2><p>We are seeking a detail-oriented and analytical <strong>Quality Assurance (QA) Analyst</strong> to join our team. The ideal candidate will be responsible for ensuring the quality and functionality through comprehensive testing, issue tracking, and process improvement. You will collaborate closely with development, product, and operations teams to deliver high-quality solutions that meet business and user requirements.<h2 classname=title>Key Responsibilities</h2><ul><li>Develop, execute, and maintain <strong>manual and automated test cases</strong> based on functional and technical requirements.<li>Identify, document, and track <strong>bugs, defects, and inconsistencies</strong> using issue-tracking tools (e.g., <strong>JIRA</strong>).<li>Perform various types of testing including <strong>functional, regression, integration, system, performance,</strong> and <strong>UAT (User Acceptance Testing)</strong>.<li>Collaborate with <strong>developers, product managers,</strong> and other stakeholders to understand project requirements and ensure alignment with quality standards.<li>Create and maintain detailed <strong>test plans, test scripts,</strong> and <strong>test data</strong> to support thorough testing processes.<li>Analyze test results to identify trends, root causes, and potential improvements in the software development lifecycle.<li>Participate in <strong>agile/scrum</strong> ceremonies, providing feedback and updates on QA activities.<li>Contribute to the continuous improvement of <strong>QA processes</strong>, tools, and methodologies.</ul><h2 classname=title>Required Qualifications</h2><ul><li><strong>Bachelor’s degree</strong> in Computer Science, Information Technology, or a related field.<li>Proven experience as a <strong>QA Analyst</strong> or in a similar role within software development.<li>Strong understanding of <strong>QA methodologies, tools,</strong> and <strong>processes</strong>.<li>Experience with <strong>test automation tools</strong> (e.g., <strong>Selenium, TestNG, JUnit, Cypress</strong>).<li>Proficiency in <strong>SQL</strong> for data validation and backend testing.<li>Familiarity with <strong>API testing tools</strong> (e.g., <strong>Postman, SoapUI</strong>) and knowledge of RESTful services.<li>Strong <strong>analytical and problem-solving</strong> skills with attention to detail.<li>Excellent <strong>communication</strong> and <strong>collaboration</strong> abilities.</ul><h2 classname=title>Preferred Qualifications</h2><ul><li>Experience working in an <strong>Agile/Scrum</strong> development environment.<li>Knowledge of <strong>CI/CD pipelines</strong> and integration of automated tests in build processes.<li>Exposure to <strong>performance testing tools</strong> (e.g., <strong>JMeter, LoadRunner</strong>).<li>Basic understanding of <strong>programming languages</strong> like <strong>Java, Python,</strong> or <strong>JavaScript</strong> for writing automation scripts.<li>Experience with <strong>cloud platforms</strong> (AWS, Azure) and testing in cloud-based environments.</ul><p><strong>If you’re passionate about software quality and thrive in dynamic environments, we’d love to hear from you!</strong>",
        "slug": "qa-analyst"
    }
  ]
  